website/app/controllers/performance_benchmarks_controller.rb

SELECT "performance_benchmarks".* FROM "performance_benchmarks" ORDER BY "performance_benchmarks"."created_at" DESC
---
   def index
      @performance_benchmarks = PerformanceBenchmark.order(created_at: :desc)

INSERT INTO "performance_benchmarks" ("name", "created_at", "linux_os", "benchmarks", "results", "user_id") VALUES ('Test', '2025-01-03 20:29:08.889551', 'Ubuntu', '["","Memory","Network"]', NULL, 1) RETURNING "id"
---
   def create
    @performance_benchmark = current_user ? current_user.performance_benchmarks.new(performance_benchmark_params) : PerformanceBenchmark.new(performance_benchmark_params)

    if @performance_benchmark.save

DELETE FROM "performance_benchmarks" WHERE "performance_benchmarks"."id" = 48
---
   def destroy
    @performance_benchmark.destroy

SELECT "performance_benchmarks".* FROM "performance_benchmarks" WHERE "performance_benchmarks"."id" = 19 LIMIT 1
---
   def share
     @performance_benchmark = current_user.performance_benchmarks.find(params[:id])

SELECT "performance_benchmarks".* FROM "performance_benchmarks" WHERE "performance_benchmarks"."id" = 51 LIMIT 1
---
   def set_benchmark
      @performance_benchmark = PerformanceBenchmark.find(params[:id])