linux_bench_hub/app/controllers/benchmarks_controller.rb

   def index
     @benchmarks = PerformanceBenchmark.all
---
SELECT "performance_benchmarks".* FROM "performance_benchmarks"

   def show
     @benchmark = PerformanceBenchmark.find(params[:id])
---
SELECT "performance_benchmarks".* FROM "performance_benchmarks" WHERE "performance_benchmarks"."id" = 2 LIMIT 1