linux_bench_hub/app/jobs/benchmark_job.rb

SELECT "performance_benchmarks".* FROM "performance_benchmarks" WHERE "performance_benchmarks"."id" = 49 LIMIT 1
---
  def perform(performance_benchmark_id)
    performance_benchmark = PerformanceBenchmark.find(performance_benchmark_id)